	  
// Как я думаю что будет использоваться модуль:
// 
//  СоединениеКафка = НовоеОписаниеСоединения("http:\\localhost:");
//  Подписчик = НовыйПодписчик(СоединениеКафка);
//  Подписаться(Подписчик, "1c.topic");
//  Сообщения = ПолучитьСообщения(Подписчик);
//  
//  СообщенияУспешноОбработанных = Новый Массив;
//  СообщенияОбработанныхСОшибкой = Новый Массив;
//  
//  Для каждого Собщение из Сообщения Цикл
//    РезультатОбработки = ВыполнитьОбработкуСообщения(Сообщение);
//    ЗафиксироватьРезультат(РезультатОбработки, СообщенияУспешноОбработанных, СообщенияОбработанныхСОшибкой);
//  КонецЦикла
//  
//  ЛогикаПодтверждения = ПодтверждатьСообщенияДоПоявленияОшибки или ПодтверждатьВсеПолученные;
//  
//  ПодтвердитьПолучение(Подписчик);
//  УдалитьПодисчика(Подписчик);
//  
//  Перед подтверждением может выполняться попытка обработки сообщений и тогда результат обработки может влиять на подтверждение.
//  
//  СоединениеКафка = НовоеОписаниеСоединения("http:\\localhost:");
//  Отправитель = НовыйОтправитель(СоединениеКафка);
//  СоздатьТопик(Отправитель, "1c.topic", КоличествоРазделов = 1);
//  ОтправитьСообщения(Отправитель, МассивСообщений, Топик):
//  
//  
//   
//Необходимые объекты:
//Подписчик 
// - БазовыйАдрес
// - ИмяГруппыПодписчиков
// - ИмяЭкземпляраПодписчика
// - ИспользоватьАвтоподтверждение
// - Топики 
// - Соединение
//
//Данные из топиков
// - 
//
//
//
//
//СдвигиТопиков
//
//


Функция НовоеОписаниеСоединения(БазовыйАдрес, ФорматОбмена = "json") Экспорт 
	
	ВозможныеФорматы = Новый Массив;
	ВозможныеФорматы.Добавить("json");
	ВозможныеФорматы.Добавить("binary");
	
	МассивОпераций = Новый Массив();
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ИсторияОпераций", МассивОпераций);
	РезультатВыполнения.Вставить("ИнформацияОбОперации", Неопределено);
	РезультатВыполнения.Вставить("ОшибкаВыполнения", Ложь);

	СвойстваСоединения = Новый Структура;
	СвойстваСоединения.Вставить("Адрес", БазовыйАдрес);
	СвойстваСоединения.Вставить("Формат", ФорматОбмена);
	СвойстваСоединения.Вставить("КешСоединения", Неопределено);
	СвойстваСоединения.Вставить("РезультатСоединения", РезультатВыполнения);
	
	ВыполнитьКонтрольДопустимыхФорматов(СвойстваСоединения, ВозможныеФорматы);
	
	Возврат СвойстваСоединения; 
	
КонецФункции

Процедура ВыполнитьКонтрольДопустимыхФорматов(СвойстваСоединения, ВозможныеФорматы)
	
	Формат = СвойстваСоединения.Формат;
	Если ВозможныеФорматы.Найти(Формат) = Неопределено Тогда 
		ЭтоОшибка = Истина;
		ШаблонСообщения = НСтр("ru = 'Формат обмена: %1 не поддерживается данным модулем! '");
		Сообщение = СтрШаблон(ШаблонСообщения, Формат);	
	Иначе
		ЭтоОшибка = Ложь;		
		ШаблонСообщения = НСтр("ru = 'Проверка выполнена успешно. Формат обмена: %1 поддерживается данным модулем. '");
		Сообщение = СтрШаблон(ШаблонСообщения, Формат);
	КонецЕсли;
		
	ДополнитьПротоколСоединения(СвойстваСоединения, Сообщение, ЭтоОшибка)
			
КонецПроцедуры

Процедура ДополнитьПротоколСоединения(СвойстваСоединения, Сообщение, ЭтоОшибка)
	
	РезультатСоединения = СвойстваСоединения.РезультатСоединения;
	РезультатСоединения.ИсторияОпераций.Добавить(Сообщение);
	РезультатСоединения.ИнформацияОбОперации = Сообщение;
	РезультатСоединения.ОшибкаВыполнения = ЭтоОшибка;

КонецПроцедуры

Функция НовыйОтправитель(ОписаниеСоединения, 
						ИмяТопика,
						Ключ = Неопределено,
						Раздел = Неопределено)
	
	ОписаниеОтправителя = СвойстваОтправителя();
	ОписаниеОтправителя.ОписаниеСоединения = ОписаниеСоединения;
	ОписаниеОтправителя.Топик = ИмяТопика;
	ОписаниеОтправителя.Ключ = ИмяТопика;
	ОписаниеОтправителя.Раздел = Раздел;	
	
КонецФункции

Функция НовыйПодписчик( ОписаниеСоединения, 
						ИмяГруппыПодписчиков = Неопределено, 
						ИмяЭкземпляраПодписчика = Неопределено, 
						ИспользоватьАвтоподтверждение = Ложь)
	
	СгенерироватьИмяПустомуЗначению(ИмяГруппыПодписчиков);
	СгенерироватьИмяПустомуЗначению(ИмяЭкземпляраПодписчика);
		
	ОписаниеПодписчика = СвойстваПодписчика();
	ОписаниеПодписчика.ОписаниеСоединения = ОписаниеСоединения;
	ОписаниеПодписчика.ИмяГруппыПодписчиков = ИмяГруппыПодписчиков;
	ОписаниеПодписчика.ИмяЭкземпляраПодписчика = ИмяЭкземпляраПодписчика;
	ОписаниеПодписчика.ИспользоватьАвтоподтверждение = ИспользоватьАвтоподтверждение;
	
	
КонецФункции

Процедура СгенерироватьИмяПустомуЗначению(Имя)
	Если Имя = Неопределено Тогда
		Имя = СокрЛП(Новый УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры
	
Функция СвойстваПодписчика()
	
	СтруктураПодписчика = Новый Структура;
	СтруктураПодписчика.Вставить("ОписаниеСоединения");
	СтруктураПодписчика.Вставить("ИмяГруппыПодписчиков");
	СтруктураПодписчика.Вставить("ИмяЭкземпляраПодписчика");
	СтруктураПодписчика.Вставить("ИспользоватьАвтоподтверждение");
	СтруктураПодписчика.Вставить("Топики");
	СтруктураПодписчика.Вставить("СдвигТекущий");
	СтруктураПодписчика.Вставить("СдвигПолученныхСообщений");

	Возврат СтруктураПодписчика;
	
КонецФункции

Функция СвойстваОтправителя()
	
	СтруктураПодписчика = Новый Структура;
	СтруктураПодписчика.Вставить("ОписаниеСоединения");
	СтруктураПодписчика.Вставить("Топик");
	СтруктураПодписчика.Вставить("Ключ");
	СтруктураПодписчика.Вставить("Раздел");

	Возврат СтруктураПодписчика;
	
КонецФункции

//
	  
// Необходимые методы:
//СоздатьПодписчикаЭкземпляр(ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, ИспользоватьАвтоподтверждение  
//CreateConsumerInstance(ConsumerGroupName, ConsumerInstanceName,  AutoCommitEnable 
//Подписаться(ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, Топики, 
//Subscribe(ConsumerGroupName, ConsumerInstanceName, Topics, 
//ДанныеИзТопиковПодписчика(ИмяЭкземпляраПодписчика
//ConsumerTopicData(ConsumerInstanceName
//ПодтвердитьПодписчикаСдвиг(ИмяЭкземпляраПодписчика, СдвигиТопиков
//CommitConsumersOffset(ConsumerInstanceName, TopicsOffsets
//УдалитьПодписчика(
//DeleteSubscriber( 
//
//
//
//
//
