	  
// Как я думаю что будет использоваться модуль:
// 
//  СоединениеКафка = НовоеОписаниеСоединения("http:\\localhost:");
//  Подписчик = НовыйПодписчик(СоединениеКафка);
//  Подписаться(Подписчик, "1c.topic");
//  Сообщения = ПолучитьСообщения(Подписчик);
//  
//  СообщенияУспешноОбработанных = Новый Массив;
//  СообщенияОбработанныхСОшибкой = Новый Массив;
//  
//  Для каждого Собщение из Сообщения Цикл
//    РезультатОбработки = ВыполнитьОбработкуСообщения(Сообщение);
//    ЗафиксироватьРезультат(РезультатОбработки, СообщенияУспешноОбработанных, СообщенияОбработанныхСОшибкой);
//  КонецЦикла
//  
//  ЛогикаПодтверждения = ПодтверждатьСообщенияДоПоявленияОшибки или ПодтверждатьВсеПолученные;
//  
//  ПодтвердитьПолучение(Подписчик);
//  УдалитьПодисчика(Подписчик);
//  
//  Перед подтверждением может выполняться попытка обработки сообщений и тогда результат обработки может влиять на подтверждение.
//  
//  СоединениеКафка = НовоеОписаниеСоединения("http:\\localhost:");
//  Отправитель = НовыйОтправитель(СоединениеКафка);
//  СоздатьТопик(Отправитель, "1c.topic", КоличествоРазделов = 1);
//  ОтправитьСообщения(Отправитель, МассивСообщений, Топик):
//  
//  
//   
//Необходимые объекты:
//Подписчик 
// - БазовыйАдрес
// - ИмяГруппыПодписчиков
// - ИмяЭкземпляраПодписчика
// - ИспользоватьАвтоподтверждение
// - Топики 
// - Соединение
//
//Данные из топиков
// - 
//
//
//
//
//СдвигиТопиков
//
//

#Область ПрограммныйИнтерфейс

Функция НовоеОписаниеСоединения(БазовыйАдрес, ФорматОбмена = "json") Экспорт 
	
	ВозможныеФорматы = Новый Массив;
	ВозможныеФорматы.Добавить("json");
	ВозможныеФорматы.Добавить("binary");
	
	МассивОпераций = Новый Массив();
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ИсторияОпераций", МассивОпераций);
	РезультатВыполнения.Вставить("ИнформацияОбОперации", Неопределено);
	РезультатВыполнения.Вставить("ОшибкаВыполнения", Ложь);

	СвойстваСоединения = Новый Структура;
	СвойстваСоединения.Вставить("Адрес", БазовыйАдрес);
	СвойстваСоединения.Вставить("Формат", ФорматОбмена);
	СвойстваСоединения.Вставить("Заголовки", Неопределено);
	СвойстваСоединения.Вставить("КешСоединения", Неопределено);
	СвойстваСоединения.Вставить("РезультатСоединения", РезультатВыполнения);
	
	ВыполнитьКонтрольДопустимыхФорматов(СвойстваСоединения, ВозможныеФорматы);
	
	ЗаполнитьЗаголовки(СвойстваСоединения, ФорматОбмена);
	
	Возврат СвойстваСоединения; 
	
КонецФункции


Функция НовыйОтправитель(ОписаниеСоединения) Экспорт
	
	ОписаниеОтправителя = СвойстваОтправителя();
	ОписаниеОтправителя.ОписаниеСоединения = ОписаниеСоединения;

	ВыполнитьЛогированиеНовыйОтправитель(ОписаниеСоединения);
		
	Возврат ОписаниеОтправителя;
	
КонецФункции
   
Функция НовыйПодписчик( ОписаниеСоединения, 
						ИмяГруппыПодписчиков = Неопределено, 
						ИмяЭкземпляраПодписчика = Неопределено, 
						ИспользоватьАвтоподтверждение = Ложь,
						МаксимальныйРазмерОтветаБайт = 100) Экспорт
	
	СгенерироватьИмяПустомуЗначению(ИмяГруппыПодписчиков);
	СгенерироватьИмяПустомуЗначению(ИмяЭкземпляраПодписчика);
		
	ОписаниеПодписчика = СвойстваПодписчика();
	ОписаниеПодписчика.ОписаниеСоединения = ОписаниеСоединения;
	ОписаниеПодписчика.ИмяГруппыПодписчиков = ИмяГруппыПодписчиков;
	ОписаниеПодписчика.ИмяЭкземпляраПодписчика = ИмяЭкземпляраПодписчика;
	ОписаниеПодписчика.ИспользоватьАвтоподтверждение = ИспользоватьАвтоподтверждение;
	ОписаниеПодписчика.МаксимальныйРазмерОтветаБайт = МаксимальныйРазмерОтветаБайт;

	ВыполнитьЛогированиеНовыйПодписчик(ОписаниеСоединения); 	
	
	Возврат ОписаниеПодписчика;
	
КонецФункции

Процедура ЗарегистрироватьПодписчика(Подписчик) Экспорт 
	
	ОписаниеСоединения = Подписчик.ОписаниеСоединения;    	
	Заголовки = ЗаголовкиСоединения(ОписаниеСоединения);
     
	
	МассивАдреса = Новый Массив;
	МассивАдреса.Добавить(ОписаниеСоединения.Адрес);
	МассивАдреса.Добавить("consumers");
	МассивАдреса.Добавить(Подписчик.ИмяГруппыПодписчиков);       
	Адрес = СтрСоединить(МассивАдреса, "/");      
	
	
	//ПараметрыПодписчика = Новый Соответствие;                        
	//ПараметрыПодписчика.Вставить("name", Подписчик.ИмяЭкземпляраПодписчика);
	//ПараметрыПодписчика.Вставить("format", "json");               
	//ПараметрыПодписчика.Вставить("auto.offset.reset", "earliest"); 

	//Если  Не Подписчик.ИспользоватьАвтоподтверждение Тогда
	//	ПараметрыПодписчика.Вставить("auto.commit.enable", "false");
	//КонецЕсли; 
	
	ПараметрыПодписчика = Новый Структура;                        
	ПараметрыПодписчика.Вставить("name", Подписчик.ИмяЭкземпляраПодписчика);
	ПараметрыПодписчика.Вставить("format", "json");               
	ПараметрыПодписчика.Вставить("auto_offset_reset", "earliest"); 

	Если  Не Подписчик.ИспользоватьАвтоподтверждение Тогда
		ПараметрыПодписчика.Вставить("auto_commit_enable", "false");
	КонецЕсли;

	ПараметрыПодписчика = КоннекторHTTP.ОбъектВJson(ПараметрыПодписчика);
	
	Если  Не Подписчик.ИспользоватьАвтоподтверждение Тогда
 	   ПараметрыПодписчика = СтрЗаменить(ПараметрыПодписчика, "auto_commit_enable", "auto.commit.enable"); 
	КонецЕсли;
	
	ПараметрыПодписчика = СтрЗаменить(ПараметрыПодписчика, "auto_offset_reset", "auto.offset.reset"); 	

	Результат = КоннекторHTTP.Post(Адрес, ПараметрыПодписчика, Заголовки);      

	ВыполнитьЛогированиеЗарегистрироватьПодписчика(Подписчик, Результат, ПараметрыПодписчика);
	
КонецПроцедуры

Функция ПолучитьСдвиги(Подписчик) Экспорт 
	
	ОписаниеСоединения = Подписчик.ОписаниеСоединения;    	
	Заголовки = ЗаголовкиСоединения(ОписаниеСоединения);
	
	МассивАдреса = Новый Массив;
	МассивАдреса.Добавить(ОписаниеСоединения.Адрес);
	МассивАдреса.Добавить("consumers");
	МассивАдреса.Добавить(Подписчик.ИмяГруппыПодписчиков);  
	МассивАдреса.Добавить("instances");
	МассивАдреса.Добавить(Подписчик.ИмяЭкземпляраПодписчика);
	МассивАдреса.Добавить("offsets");   

	Адрес = СтрСоединить(МассивАдреса, "/");
	
	ОтветЗапроса = КоннекторHTTP.Get(Адрес, , Заголовки);
	
	Сдвиги = Новый Массив;
	Если ОтветЗапроса.КодСостояния = 200 Тогда
		
		ПолученныеДанные = КоннекторHTTP.КакJson(ОтветЗапроса);
		Если ПолученныеДанные.Количество() > 0 Тогда
			
			
			Для каждого ЗаписьДанных Из ПолученныеДанные Цикл
				
				Сдвиги.Добавить(ЗаписьДанных);
						
			КонецЦикла;
			
		КонецЕсли;  		
	КонецЕсли;
	
	ВыполнитьЛогированиеПолучитьСдвиги(Подписчик, ОтветЗапроса);
	
	Возврат Сдвиги;

КонецФункции

Процедура ВыполнитьЛогированиеПолучитьСдвиги(Подписчик, Ответ)
	
	ТелоОтвет = КоннекторHTTP.КакТекст(Ответ);
	
	ШаблонСообщения = НСтр("ru = 'Отправлен запрос и получен ответ по адресу: %1     
	|Метод: %2
	|КодОтвета: %3
	|Тело ответа %4
	|Время выполнения: %5'");      
	
	Сообщение = СтрШаблон(
		ШаблонСообщения, 
		Ответ.URL,
		"GET",
		Ответ.КодСостояния, 
		ТелоОтвет,
		Ответ.ВремяВыполнения);
	
	ДополнитьПротоколСоединения(Подписчик.ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры

Функция ПолучитьСообщения(Подписчик) Экспорт 
	
	ОписаниеСоединения = Подписчик.ОписаниеСоединения;    	
	Заголовки = ЗаголовкиСоединения(ОписаниеСоединения);
	
	МассивАдреса = Новый Массив;
	МассивАдреса.Добавить(ОписаниеСоединения.Адрес);
	МассивАдреса.Добавить("consumers");
	МассивАдреса.Добавить(Подписчик.ИмяГруппыПодписчиков);  
	МассивАдреса.Добавить("instances");
	МассивАдреса.Добавить(Подписчик.ИмяЭкземпляраПодписчика);
	МассивАдреса.Добавить("records");   

	Адрес = СтрСоединить(МассивАдреса, "/");
	
	ПараметрыЗапроса = Новый Структура;
	Если ЗначениеЗаполнено(Подписчик.МаксимальныйРазмерОтветаБайт) Тогда
		ПараметрыЗапроса.Вставить("max_bytes", Подписчик.МаксимальныйРазмерОтветаБайт);
	КонецЕсли;

	
	ОтветЗапроса = КоннекторHTTP.Get(Адрес, ПараметрыЗапроса, Заголовки);
	
	МиниммальныйСдвиг = Неопределено;
	МаксимальныйСдвиг = Неопределено;
	Сообщения = Новый Массив;
	Если ОтветЗапроса.КодСостояния = 200 Тогда
		
		ПолученныеДанные = КоннекторHTTP.КакJson(ОтветЗапроса);
		Если ПолученныеДанные.Количество() > 0 Тогда
			
			ДатаСобытия = ТекущаяДата();
			
			Для каждого ЗаписьДанных Из ПолученныеДанные Цикл
				
				Сообщения.Добавить(ЗаписьДанных);
				
				Партиция = ЗаписьДанных["partition"];
				Сдвиг = ЗаписьДанных["offset"]; 
				
				МиниммальныйСдвиг = ?(МиниммальныйСдвиг = Неопределено, Сдвиг, МиниммальныйСдвиг);
				МаксимальныйСдвиг = ?(МаксимальныйСдвиг = Неопределено, Сдвиг, МаксимальныйСдвиг);
				
				МиниммальныйСдвиг = Мин(МиниммальныйСдвиг,Сдвиг);
				МаксимальныйСдвиг = Макс(МаксимальныйСдвиг, Сдвиг);;

				
				//Сообщить( "partition: " + ЗаписьДанных["partition"] + "offset: " + ЗаписьДанных["offset"]+ "key: " + ЗаписьДанных["key"] + ЗаписьДанных["topic"] + ЗаписьДанных["value"] );
			КонецЦикла;
			
		КонецЕсли;      
		
	КонецЕсли;
	
	ВыполнитьЛогированиеПолучитьСообщения(Подписчик, ОтветЗапроса, МиниммальныйСдвиг, МаксимальныйСдвиг);
	
	Возврат Сообщения;

КонецФункции

Процедура ПодтвердитьПолучение(Подписчик, СвойстваПодтверждения) Экспорт 
	
    ОписаниеСоединения = Подписчик.ОписаниеСоединения;    	
    Заголовки = ЗаголовкиСоединения(ОписаниеСоединения);
    
    МассивАдреса = Новый Массив;
    МассивАдреса.Добавить(ОписаниеСоединения.Адрес);
    МассивАдреса.Добавить("consumers");
    МассивАдреса.Добавить(Подписчик.ИмяГруппыПодписчиков);  
    МассивАдреса.Добавить("instances");
    МассивАдреса.Добавить(Подписчик.ИмяЭкземпляраПодписчика);
    МассивАдреса.Добавить("offsets");

    Адрес = СтрСоединить(МассивАдреса, "/");

    
    Оффсет = Новый Структура; 
    Оффсет.Вставить("topic", СвойстваПодтверждения.Топик);
    Оффсет.Вставить("partition", СвойстваПодтверждения.Партиция);
    Оффсет.Вставить("offset", СвойстваПодтверждения.Сдвиг);
    
    МассивОффсетов = Новый Массив;
    МассивОффсетов.Добавить(Оффсет);
    
    ПараметрОффсетов = Новый Структура;
    ПараметрОффсетов.Вставить("offsets", МассивОффсетов);
    
    ПараметрОффсетов = КоннекторHTTP.ОбъектВJson(ПараметрОффсетов);
    
    РезультатПодтверждениеОффсета = КоннекторHTTP.Post(Адрес, ПараметрОффсетов, Заголовки);    
	
	ВыполнитьЛогированиеПодтвердитьПолучение(Подписчик, ПараметрОффсетов, РезультатПодтверждениеОффсета);

КонецПроцедуры

Процедура ПерезаписатьСдвиг(Подписчик, СвойстваСдвига) Экспорт 
	
    ОписаниеСоединения = Подписчик.ОписаниеСоединения;    	
    Заголовки = ЗаголовкиСоединения(ОписаниеСоединения);
    
    МассивАдреса = Новый Массив;
    МассивАдреса.Добавить(ОписаниеСоединения.Адрес);
    МассивАдреса.Добавить("consumers");
    МассивАдреса.Добавить(Подписчик.ИмяГруппыПодписчиков);  
    МассивАдреса.Добавить("instances");
    МассивАдреса.Добавить(Подписчик.ИмяЭкземпляраПодписчика);
    МассивАдреса.Добавить("positions");

    Адрес = СтрСоединить(МассивАдреса, "/");

    
    Оффсет = Новый Структура; 
    Оффсет.Вставить("topic", СвойстваСдвига.Топик);
    Оффсет.Вставить("partition", СвойстваСдвига.Партиция);
    Оффсет.Вставить("offset", СвойстваСдвига.Сдвиг);
    
    МассивОффсетов = Новый Массив;
    МассивОффсетов.Добавить(Оффсет);
    
    ПараметрОффсетов = Новый Структура;
    ПараметрОффсетов.Вставить("offsets", МассивОффсетов);
    
    ПараметрОффсетов = КоннекторHTTP.ОбъектВJson(ПараметрОффсетов);
    
    РезультатПодтверждениеОффсета = КоннекторHTTP.Post(Адрес, ПараметрОффсетов, Заголовки);    
	
	ВыполнитьЛогированиеПерезаписатьСдвиг(Подписчик, ПараметрОффсетов, РезультатПодтверждениеОффсета);

КонецПроцедуры

Процедура НазначитьПолучателюТопикИРаздел(Подписчик, Топик, Раздел) Экспорт 
	
    ОписаниеСоединения = Подписчик.ОписаниеСоединения;    	
    Заголовки = ЗаголовкиСоединения(ОписаниеСоединения);
    
    МассивАдреса = Новый Массив;
    МассивАдреса.Добавить(ОписаниеСоединения.Адрес);
    МассивАдреса.Добавить("consumers");
    МассивАдреса.Добавить(Подписчик.ИмяГруппыПодписчиков);  
    МассивАдреса.Добавить("instances");
    МассивАдреса.Добавить(Подписчик.ИмяЭкземпляраПодписчика);
    МассивАдреса.Добавить("assignments");

    Адрес = СтрСоединить(МассивАдреса, "/");

    
    ТопикИРаздел = Новый Структура; 
    ТопикИРаздел.Вставить("topic", Топик);
    ТопикИРаздел.Вставить("partition", Раздел);
    
    МассивТопиковИРазделов = Новый Массив;
    МассивТопиковИРазделов.Добавить(ТопикИРаздел);
    
    ПараметрОффсетов = Новый Структура;
    ПараметрОффсетов.Вставить("partitions", МассивТопиковИРазделов);
    
    ПараметрОффсетов = КоннекторHTTP.ОбъектВJson(ПараметрОффсетов);
    
    РезультатПодтверждениеОффсета = КоннекторHTTP.Post(Адрес, ПараметрОффсетов, Заголовки);    
	
	ВыполнитьЛогированиеНазначитьПолучателюТопикИРаздел(Подписчик, ПараметрОффсетов, РезультатПодтверждениеОффсета);

КонецПроцедуры

Процедура ВыполнитьЛогированиеНазначитьПолучателюТопикИРаздел(Подписчик, ТекстЗапроса, Ответ)
	
	ТелоОтвет = КоннекторHTTP.КакТекст(Ответ);
		
	ШаблонСообщения = НСтр("ru = 'Отправлен запрос и получен ответ по адресу: %1     
	|Тело запроса: %2
	|КодОтвета: %3
	|Тело ответа %4
	|Время выполнения: %5'");  
	
	Сообщение = СтрШаблон(
		ШаблонСообщения, 
		Ответ.URL,
		ТекстЗапроса,
		Ответ.КодСостояния, 
		ТелоОтвет,
		Ответ.ВремяВыполнения);
	
	ДополнитьПротоколСоединения(Подписчик.ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры

Процедура ВыполнитьЛогированиеПерезаписатьСдвиг(Подписчик, ТекстЗапроса, Ответ)
	
	ТелоОтвет = КоннекторHTTP.КакТекст(Ответ);
		
	ШаблонСообщения = НСтр("ru = 'Отправлен запрос и получен ответ по адресу: %1     
	|Тело запроса: %2
	|КодОтвета: %3
	|Тело ответа %4
	|Время выполнения: %5'");  
	
	Сообщение = СтрШаблон(
		ШаблонСообщения, 
		Ответ.URL,
		ТекстЗапроса,
		Ответ.КодСостояния, 
		ТелоОтвет,
		Ответ.ВремяВыполнения);
	
	ДополнитьПротоколСоединения(Подписчик.ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры

Процедура ВыполнитьЛогированиеПодтвердитьПолучение(Подписчик, ТекстЗапроса, Ответ)
	
	ТелоОтвет = КоннекторHTTP.КакТекст(Ответ);
		
	ШаблонСообщения = НСтр("ru = 'Отправлен запрос и получен ответ по адресу: %1     
	|Тело запроса: %2
	|КодОтвета: %3
	|Тело ответа %4
	|Время выполнения: %5'");  
	
	Сообщение = СтрШаблон(
		ШаблонСообщения, 
		Ответ.URL,
		ТекстЗапроса,
		Ответ.КодСостояния, 
		ТелоОтвет,
		Ответ.ВремяВыполнения);
	
	ДополнитьПротоколСоединения(Подписчик.ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры


Процедура УдалитьПодисчика(Подписчик) Экспорт 
	
	ОписаниеСоединения = Подписчик.ОписаниеСоединения;    	
	Заголовки = ЗаголовкиСоединения(ОписаниеСоединения);
	
	МассивАдреса = Новый Массив;
	МассивАдреса.Добавить(ОписаниеСоединения.Адрес);
	МассивАдреса.Добавить("consumers");
	МассивАдреса.Добавить(Подписчик.ИмяГруппыПодписчиков);  
	МассивАдреса.Добавить("instances");
	МассивАдреса.Добавить(Подписчик.ИмяЭкземпляраПодписчика);

	Адрес = СтрСоединить(МассивАдреса, "/");
     
    // Удаление подписчика
    РезультатУдаления =  КоннекторHTTP.Delete(Адрес, , Заголовки);  
	
	ВыполнитьЛогированиеУдалитьПодисчика(Подписчик, РезультатУдаления);

КонецПроцедуры

Процедура ВыполнитьЛогированиеУдалитьПодисчика(Подписчик, Ответ)
	
	ТелоОтвет = КоннекторHTTP.КакТекст(Ответ);
		
	ШаблонСообщения = НСтр("ru = 'Отправлен запрос и получен ответ по адресу: %1     
	|Метод: %2
	|КодОтвета: %3
	|Тело ответа %4
	|Время выполнения: %5'");  
	
	Сообщение = СтрШаблон(
		ШаблонСообщения, 
		Ответ.URL,
		"Delete",
		Ответ.КодСостояния, 
		ТелоОтвет,
		Ответ.ВремяВыполнения);
	
	ДополнитьПротоколСоединения(Подписчик.ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры


Процедура ВыполнитьЛогированиеПолучитьСообщения(Подписчик, Ответ, МиниммальныйСдвиг, МаксимальныйСдвиг)
	
	//Тело ответа не выводится специально, т.к. оно может быть очень большим.
	
	ШаблонСообщения = НСтр("ru = 'Отправлен запрос и получен ответ по адресу: %1     
	|Метод: %2
	|КодОтвета: %3
	|Получены сообщения сдвигов: с %4 по %5
	|Время выполнения: %6'");      
	
	Сообщение = СтрШаблон(
		ШаблонСообщения, 
		Ответ.URL,
		"GET",
		Ответ.КодСостояния, 
		МиниммальныйСдвиг,
		МаксимальныйСдвиг,
		Ответ.ВремяВыполнения);
	
	ДополнитьПротоколСоединения(Подписчик.ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры

Функция ЗаголовкиСоединения(Знач ОписаниеСоединения,  ЗаполнитьТипОтправляемогоКонтента = Истина, ЗаполнитьТипПринимаемогоКонтента = Истина)
	
	КопияСтруктуры = Новый Структура;
	Для Каждого ЭлементСтруктуры Из ОписаниеСоединения.Заголовки Цикл
		КопияСтруктуры.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
	КонецЦикла;
	
	Заголовки = КопияСтруктуры;
	
	Если ЗаполнитьТипПринимаемогоКонтента = Ложь Тогда
		Заголовки.Заголовки.Удалить("Accept");
	КонецЕсли;
	
	Если ЗаполнитьТипОтправляемогоКонтента = Ложь Тогда
		Заголовки.Заголовки.Удалить("Content-Type");
	КонецЕсли;
	
	Возврат Заголовки;

КонецФункции      

Процедура ВыполнитьЛогированиеЗарегистрироватьПодписчика(Подписчик, РезультатПодписки, ТелоЗапроса)
	
	ТелоОтвет = КоннекторHTTP.КакТекст(РезультатПодписки);
	ШаблонСообщения = НСтр("ru = 'Отправлен запрос и получен ответ по адресу: %1     
	|Тело запроса: %2
	|КодОтвета: %3
	|Тело ответа %4
	|Время выполнения: %5'");      
	
	Сообщение = СтрШаблон(
		ШаблонСообщения, 
		РезультатПодписки.URL,
		ТелоЗапроса,
		РезультатПодписки.КодСостояния, 
		ТелоОтвет,
		РезультатПодписки.ВремяВыполнения);
	
	ДополнитьПротоколСоединения(Подписчик.ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры


Процедура Подписаться(Подписчик, Топик) Экспорт 

	ОписаниеСоединения = Подписчик.ОписаниеСоединения;
    Заголовки = ЗаголовкиСоединения(ОписаниеСоединения);
	
	МассивАдреса = Новый Массив;
	МассивАдреса.Добавить(ОписаниеСоединения.Адрес);
	МассивАдреса.Добавить("consumers");
	МассивАдреса.Добавить(Подписчик.ИмяГруппыПодписчиков);  
	МассивАдреса.Добавить("instances");
	МассивАдреса.Добавить(Подписчик.ИмяЭкземпляраПодписчика);
	МассивАдреса.Добавить("subscription");   

	Адрес = СтрСоединить(МассивАдреса, "/");


	ТемаПодписки = Новый Массив();
	ТемаПодписки.Добавить(Топик);
	
	ТопикиПодписки = Новый Структура;
	ТопикиПодписки.Вставить("topics", ТемаПодписки);
	
	ТелоЗапросаПодписки = КоннекторHTTP.ОбъектВJson(ТопикиПодписки);

 	РезультатПодписки = КоннекторHTTP.Post(Адрес, ТелоЗапросаПодписки, Заголовки); 
	
 	ВыполнитьЛогированиеПодписаться(Подписчик, РезультатПодписки, ТелоЗапросаПодписки);

КонецПроцедуры

Процедура ВыполнитьЛогированиеПодписаться(Подписчик, РезультатПодписки, ТелоЗапроса)
	
	ТелоОтвет = КоннекторHTTP.КакТекст(РезультатПодписки);
	ШаблонСообщения = НСтр("ru = 'Отправлен запрос и получен ответ по адресу: %1     
	|Тело запроса: %2
	|КодОтвета: %3
	|Тело ответа %4
	|Время выполнения: %5'");      
	
	Сообщение = СтрШаблон(
		ШаблонСообщения, 
		РезультатПодписки.URL,
		ТелоЗапроса,                                                                                        
		РезультатПодписки.КодСостояния, 
		ТелоОтвет,
		РезультатПодписки.ВремяВыполнения);
	
	ДополнитьПротоколСоединения(Подписчик.ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры


Процедура ВыполнитьЛогированиеНовыйПодписчик(Знач ОписаниеСоединения)
		
	Сообщение =  НСтр("ru = 'Создано описание структуры подписчика! '");
	ДополнитьПротоколСоединения(ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры


Процедура ВыполнитьЛогированиеНовыйОтправитель(Знач ОписаниеСоединения)
		
	Сообщение =  НСтр("ru = 'Создано описание структуры отправителя! '");
	ДополнитьПротоколСоединения(ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры

Процедура ВыполнитьЛогированиеДобавлениеСообщения(НовоеСообщение, Отправитель, Ключ, Раздел, Топик)
		
	ШаблонСообщения = НСтр("ru = 'Запрос добавления сообщение: %1
	|Топик: %2
	|Ключ %3
	|Раздел: %4'");       
	
	Если ТипЗнч(НовоеСообщение) = Тип("Строка") Тогда
		ТекстСообщения = НовоеСообщение;	
	Иначе 
		ТекстСообщения = КоннекторHTTP.ОбъектВJson(НовоеСообщение);	
	КонецЕсли;
	
	Сообщение = СтрШаблон(ШаблонСообщения, ТекстСообщения, Топик, Ключ, Раздел);
	ДополнитьПротоколСоединения(Отправитель.ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры

Процедура ОтправитьСообщения(Отправитель) Экспорт

	ОписаниеСоединения = Отправитель.ОписаниеСоединения;
	Заголовки = ЗаголовкиСоединения(ОписаниеСоединения, Истина, Ложь);
	
	
	МассивАдреса = Новый Массив;
	МассивАдреса.Добавить(ОписаниеСоединения.Адрес);
	МассивАдреса.Добавить("topics");
	Адрес = СтрСоединить(МассивАдреса, "/");
	                                                        
	СообщенияПоТопикам = Отправитель.СообщенияПоТопикам;	
	Для Каждого ТопикСообщения Из СообщенияПоТопикам Цикл
		Топик = ТопикСообщения.Ключ;
		Сообщения = ТопикСообщения.Значение;
		АдресТопика = Адрес + "/" + Топик;
		                                                       
		СоответствиеСообщений = Новый Структура("records", Сообщения);
		СообщенияПодготовленные = КоннекторHTTP.ОбъектВJson(СоответствиеСообщений);
						
		РезультатОтправкиСообщения = КоннекторHTTP.Post(АдресТопика, СообщенияПодготовленные, Заголовки);    
		
		ВыполнитьЛогированиеОтправитьСообщения(Отправитель, РезультатОтправкиСообщения);

	
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ВыполнитьЛогированиеОтправитьСообщения(Отправитель, РезультатОтправкиСообщения)
	
	ТелоОтвет = КоннекторHTTP.КакТекст(РезультатОтправкиСообщения);
	ШаблонСообщения = НСтр("ru = 'Отправлен запрос и получен ответ по адресу: %1
	|КодОтвета: %2
	|Тело ответа %3
	|Время выполнения: %4'");
	Сообщение = СтрШаблон(
		ШаблонСообщения, 
		РезультатОтправкиСообщения.URL, 
		РезультатОтправкиСообщения.КодСостояния, 
		ТелоОтвет,
		РезультатОтправкиСообщения.ВремяВыполнения);
	
	ДополнитьПротоколСоединения(Отправитель.ОписаниеСоединения, Сообщение, Ложь);

КонецПроцедуры

Процедура ДобавитьСообщение(Отправитель, Сообщение, Топик, Ключ = Неопределено, Раздел = Неопределено) Экспорт
		
	НовоеСообщение = "";	
	Если Отправитель.ОписаниеСоединения.Формат = "json" Тогда 
		
		ПараметрыСообщения = Новый Структура;    
		
		Если ЗначениеЗаполнено(Раздел) Тогда
			ПараметрыСообщения.Вставить("partition", Раздел);  
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ключ) Тогда
			ПараметрыСообщения.Вставить("key", Ключ);
		КонецЕсли;
		
		ПараметрыСообщения.Вставить("value", Сообщение);
	
		//НовоеСообщение = КоннекторHTTP.ОбъектВJson(ПараметрыСообщения);
		НовоеСообщение = ПараметрыСообщения;
	КонецЕсли;
	
	//СтруктураСообщенияКОтправка = Новый Структура;
	//СтруктураСообщенияКОтправка.Вставить("Сообщение", НовоеСообщение);
	//СтруктураСообщенияКОтправка.Вставить("ДополнительнаяИнформация");
	
	СообщенияПоТопикам = Отправитель.СообщенияПоТопикам;	
	МассивСообщенийТопика = СообщенияПоТопикам.Получить(Топик);
	
	Если МассивСообщенийТопика <> Неопределено Тогда 
		МассивСообщенийТопика.Добавить(НовоеСообщение);
	Иначе
		МассивСообщенийТопика = Новый Массив;
		МассивСообщенийТопика.Добавить(НовоеСообщение);
	КонецЕсли;
	
	СообщенияПоТопикам.Вставить(Топик, МассивСообщенийТопика); 
	
	ВыполнитьЛогированиеДобавлениеСообщения(НовоеСообщение, Отправитель, Ключ, Раздел, Топик);

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти


Процедура ВыполнитьКонтрольДопустимыхФорматов(СвойстваСоединения, ВозможныеФорматы)
	
	Формат = СвойстваСоединения.Формат;
	Если ВозможныеФорматы.Найти(Формат) = Неопределено Тогда 
		ЭтоОшибка = Истина;
		ШаблонСообщения = НСтр("ru = 'Формат обмена: %1 не поддерживается данным модулем! '");
		Сообщение = СтрШаблон(ШаблонСообщения, Формат);	
	Иначе
		ЭтоОшибка = Ложь;		
		ШаблонСообщения = НСтр("ru = 'Проверка выполнена успешно. Формат обмена: %1 поддерживается данным модулем. '");
		Сообщение = СтрШаблон(ШаблонСообщения, Формат);
	КонецЕсли;
		
	ДополнитьПротоколСоединения(СвойстваСоединения, Сообщение, ЭтоОшибка)
			
КонецПроцедуры

Процедура ДополнитьПротоколСоединения(СвойстваСоединения, Сообщение, ЭтоОшибка)
	
	РезультатСоединения = СвойстваСоединения.РезультатСоединения;
	РезультатСоединения.ИсторияОпераций.Добавить(Сообщение);
	РезультатСоединения.ИнформацияОбОперации = Сообщение;
	РезультатСоединения.ОшибкаВыполнения = ЭтоОшибка;

КонецПроцедуры

Функция СвойстваПодписчика()
	
	СтруктураПодписчика = Новый Структура;
	СтруктураПодписчика.Вставить("ОписаниеСоединения");
	СтруктураПодписчика.Вставить("ИмяГруппыПодписчиков");
	СтруктураПодписчика.Вставить("ИмяЭкземпляраПодписчика");
	СтруктураПодписчика.Вставить("ИспользоватьАвтоподтверждение");
	СтруктураПодписчика.Вставить("Топики");
	СтруктураПодписчика.Вставить("СдвигТекущий");
	СтруктураПодписчика.Вставить("СдвигПолученныхСообщений");
	СтруктураПодписчика.Вставить("МаксимальныйРазмерОтветаБайт");

	Возврат СтруктураПодписчика;
	
КонецФункции

Функция СвойстваОтправителя()
	
	СообщенияПоТопикам = Новый Соответствие;
	СтруктураОтправитея = Новый Структура;
	СтруктураОтправитея.Вставить("ОписаниеСоединения");
	//СтруктураОтправитея.Вставить("Топик");
	//СтруктураОтправитея.Вставить("Ключ");
	//СтруктураОтправитея.Вставить("Раздел");
	СтруктураОтправитея.Вставить("СообщенияПоТопикам", СообщенияПоТопикам);

	Возврат СтруктураОтправитея;
	
КонецФункции

Процедура ЗаполнитьЗаголовки(Знач СвойстваСоединения, Знач ФорматОбмена)
		
	Если ФорматОбмена = "json" Тогда
		Заголовки = Новый Соответствие;                                                                   
		Заголовки.Вставить("Content-Type", "application/vnd.kafka.json.v2+json");     
		Заголовки.Вставить("Accept", "application/vnd.kafka.json.v2+json");
		ЗаголовкиСтруктура = Новый Структура;
		ЗаголовкиСтруктура.Вставить("Заголовки", Заголовки);

		СвойстваСоединения.Вставить("Заголовки", ЗаголовкиСтруктура);
	КонецЕсли;

КонецПроцедуры


Процедура СгенерироватьИмяПустомуЗначению(Имя)
	Если Имя = Неопределено Тогда
		Имя = СокрЛП(Новый УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

//
	  
// Необходимые методы:
//СоздатьПодписчикаЭкземпляр(ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, ИспользоватьАвтоподтверждение  
//CreateConsumerInstance(ConsumerGroupName, ConsumerInstanceName,  AutoCommitEnable 
//Подписаться(ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, Топики, 
//Subscribe(ConsumerGroupName, ConsumerInstanceName, Topics, 
//ДанныеИзТопиковПодписчика(ИмяЭкземпляраПодписчика
//ConsumerTopicData(ConsumerInstanceName
//ПодтвердитьПодписчикаСдвиг(ИмяЭкземпляраПодписчика, СдвигиТопиков
//CommitConsumersOffset(ConsumerInstanceName, TopicsOffsets
//УдалитьПодписчика(
//DeleteSubscriber( 
//
//
//
//
//
