	  
//Необходимые объекты:
//Подписчик 
// - БазовыйАдрес
// - ИмяГруппыПодписчиков
// - ИмяЭкземпляраПодписчика
// - ИспользоватьАвтоподтверждение
// - Топики 
// - Соединение
//
//Данные из топиков
// - 
//
//
//
//
//СдвигиТопиков
//
//
//
	  
// Необходимые методы:
//СоздатьПодписчикаЭкземпляр(ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, ИспользоватьАвтоподтверждение  
//CreateConsumerInstance(ConsumerGroupName, ConsumerInstanceName,  AutoCommitEnable 
//Подписаться(ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, Топики, 
//Subscribe(ConsumerGroupName, ConsumerInstanceName, Topics, 
//ДанныеИзТопиковПодписчика(ИмяЭкземпляраПодписчика
//ConsumerTopicData(ConsumerInstanceName
//ПодтвердитьПодписчикаСдвиг(ИмяЭкземпляраПодписчика, СдвигиТопиков
//CommitConsumersOffset(ConsumerInstanceName, TopicsOffsets
//УдалитьПодписчика(
//DeleteSubscriber( 
//
//
//
//
//

Функция НовоеОписаниеСоединения(БазовыйАдрес, ФорматОбмена = "json")
	
	ВозможныеФорматы = Новый Массив;
	ВозможныеФорматы.Добавить("json");
	ВозможныеФорматы.Добавить("binary");
	
	МассивОпераций = Новый Массив();
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ИсторияОпераций", МассивОпераций);
	РезультатВыполнения.Вставить("ИнформацияОбОперации", Неопределено);
	РезультатВыполнения.Вставить("ОшибкаВыполнения", Ложь);

	СвойстваСоединения = Новый Структура;
	СвойстваСоединения.Вставить("Адрес", БазовыйЯдрес);
	СвойстваСоединения.Вставить("Формат", ФорматОбмена);
	СвойстваСоединения.Вставить("КешСоединения", Неопределено);
	СвойстваСоединения.Вставить("РезультатСоединения", РезультатВыполнения);
	
	ВыполнитьКонтрольДопустимыхФорматов(СвойстваСоединения, ВозможныеФорматы);
	
	Возврат СвойстваСоединения; 
	
КонецФункции

Процедура ВыполнитьКонтрольДопустимыхФорматов(СвойстваСоединения, ВозможныеФорматы)
	
	Формат = СвойстваСоединения.Формат;
	Если ВозможныеФорматы.Найти(Формат) = Неопределено Тогда 
		ЭтоОшибка = Истина;
		ШаблонСообщения = НСтр("ru = 'Формат обмена: %1 не поддерживается данным модулем! '");
		Сообщение = СтрШаблон(ШаблонСообщения, Формат);	
	Иначе
		ЭтоОшибка = Ложь;		
		ШаблонСообщения = НСтр("ru = 'Проверка выполнена успешно. Формат обмена: %1 поддерживается данным модулем. '");
		Сообщение = СтрШаблон(ШаблонСообщения, Формат);
	КонецЕсли;
		
	ДополнитьПротоколСоединения(СвойстваСоединения, Сообщение, ЭтоОшибка)
			
КонецПроцедуры

Процедура ДополнитьПротоколСоединения(СвойстваСоединения, Сообщение, ЭтоОшибка)
	
	РезультатСоединения = СвойстваСоединения.РезультатСоединения;
	РезультатСоединения.ИсторияОперадий.Добавить(Сообщение);
	РезультатСоединения.ИнформацияОбОперации = Сообщение;
	РезультатСоединения.ОшибкаВыполнения = ЭтоОшибка;

КонецПроцедуры

Функция НовыйПодписчик(ОписаниеСоединения, ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, ИспользоватьАвтоподтверждение)
	
	ОписаниеПодписчика = СвойстваПодписчика();
	
	
КонецФункции
	
Функция СвойстваПодписчика()
	
	СтруктураПодписчика = Новый Структура;
	СтруктураПодписчика.Вставить("ОписаниеСоединения");
	СтруктураПодписчика.Вставить("ИмяГруппыПодписчиков");
	СтруктураПодписчика.Вставить("ИмяЭкземпляраПодписчика");
	СтруктураПодписчика.Вставить("ИспользоватьАвтоподтверждение");
	СтруктураПодписчика.Вставить("Топики");

	Возврат СтруктураПодписчика;
	
КонецФункции
