	  
//Необходимые объекты:
//Подписчик 
// - БазовыйАдрес
// - ИмяГруппыПодписчиков
// - ИмяЭкземпляраПодписчика
// - ИспользоватьАвтоподтверждение
// - Топики 
// - Соединение
//
//Данные из топиков
// - 
//
//
//
//
//СдвигиТопиков
//
//
//
	  
// Необходимые методы:
//СоздатьПодписчикаЭкземпляр(ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, ИспользоватьАвтоподтверждение  
//CreateConsumerInstance(ConsumerGroupName, ConsumerInstanceName,  AutoCommitEnable 
//Подписаться(ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, Топики, 
//Subscribe(ConsumerGroupName, ConsumerInstanceName, Topics, 
//ДанныеИзТопиковПодписчика(ИмяЭкземпляраПодписчика
//ConsumerTopicData(ConsumerInstanceName
//ПодтвердитьПодписчикаСдвиг(ИмяЭкземпляраПодписчика, СдвигиТопиков
//CommitConsumersOffset(ConsumerInstanceName, TopicsOffsets
//УдалитьПодписчика(
//DeleteSubscriber( 
//
//
//
//
//

Функция НовоеОписаниеСоединения(БазовыйАдрес, ФорматОбмена = "json")
	
	ВозможныеФорматы = Новый Массив;
	ВозможныеФорматы.Добавить("json");
	ВозможныеФорматы.Добавить("binary");
	
	СвойстваСоединения = Новый Структура("Адрес, Формат, КешСоединения", БазовыйАдрес, ФорматОбмена, Неопределено);
	
	Возврат СвойстваСоединения; 
	
КонецФункции

Функция НовыйПодписчик(ОписаниеСоединения, ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, ИспользоватьАвтоподтверждение)
	
КонецФункции
	
Функция СвойстваПодписчика()
	
	СтруктураПодписчика = Новый Структура;
	СтруктураПодписчика.Вставить("ОписаниеСоединения");
	СтруктураПодписчика.Вставить("ИмяГруппыПодписчиков");
	СтруктураПодписчика.Вставить("ИмяЭкземпляраПодписчика");
	СтруктураПодписчика.Вставить("ИспользоватьАвтоподтверждение");
	СтруктураПодписчика.Вставить("Топики");

	Возврат СтруктураПодписчика;
	
КонецФункции