	  
//Необходимые объекты:
//Подписчик 
// - БазовыйАдрес
// - ИмяГруппыПодписчиков
// - ИмяЭкземпляраПодписчика
// - ИспользоватьАвтоподтверждение
// - Топики 
// - Соединение
//
//Данные из топиков
// - 
//
//
//
//
//СдвигиТопиков
//
//
//
	  
// Необходимые методы:
//СоздатьПодписчикаЭкземпляр(ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, ИспользоватьАвтоподтверждение  
//CreateConsumerInstance(ConsumerGroupName, ConsumerInstanceName,  AutoCommitEnable 
//Подписаться(ИмяГруппыПодписчиков, ИмяЭкземпляраПодписчика, Топики, 
//Subscribe(ConsumerGroupName, ConsumerInstanceName, Topics, 
//ДанныеИзТопиковПодписчика(ИмяЭкземпляраПодписчика
//ConsumerTopicData(ConsumerInstanceName
//ПодтвердитьПодписчикаСдвиг(ИмяЭкземпляраПодписчика, СдвигиТопиков
//CommitConsumersOffset(ConsumerInstanceName, TopicsOffsets
//УдалитьПодписчика(
//DeleteSubscriber( 
//
//
//
//
//